
&НаСервереБезКонтекста
Процедура ГенерацияДанныхНаСервере(Дата)
	ДатаТеста = НачалоМесяца(Дата);
	Для Сч = 1 По 10000 Цикл
		ДокОб = Документы.Документ1.СоздатьДокумент();
		ДокОб.Дата = ДатаТеста + Сч * 3;
		ДокОб.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ГенерацияДанных(Команда)
	ГенерацияДанныхНаСервере(Объект.Дата);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестНаСервере(Дата)
	ДатаТеста = НачалоМесяца(Дата);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗапросОстатковНаСервере(Дата)
	ДатаТеста = НачалоМесяца(Дата);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СУММА(Влож.СуммаОстаток) КАК СуммаОстаток,
	                      |	СУММА(Влож.СуммаОстаток2) КАК СуммаОстаток2
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		РегистрБухгалтерии1Остатки.СуммаОстаток КАК СуммаОстаток,
	                      |		0 КАК СуммаОстаток2
	                      |	ИЗ
	                      |		РегистрБухгалтерии.РегистрБухгалтерии1.Остатки(&Дата, Счет = ЗНАЧЕНИЕ(ПланСчетов.ПланСчетов1.Взаиморасчеты), ) КАК РегистрБухгалтерии1Остатки
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		0,
	                      |		РегистрБухгалтерии1Остатки.СуммаОстаток
	                      |	ИЗ
	                      |		РегистрБухгалтерии.РегистрБухгалтерии1.Остатки(&Дата2, Счет = ЗНАЧЕНИЕ(ПланСчетов.ПланСчетов1.Взаиморасчеты), ) КАК РегистрБухгалтерии1Остатки) КАК Влож"); 
	Запрос.УстановитьПараметр("Дата", КонецМесяца(ДатаТеста));
	Запрос.УстановитьПараметр("Дата2", ДобавитьМесяц(ДатаТеста, 3));  
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		Сообщить("На " + сокрлп(Запрос.Параметры.Дата) + " остаток " + сокрлп(Выб.СуммаОстаток));
		Сообщить("На " + сокрлп(Запрос.Параметры.Дата2) + " остаток " + сокрлп(Выб.СуммаОстаток2));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОстатков(Команда)
	ЗапросОстатковНаСервере(Объект.Дата);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестИсправленныйНаСервере(Дата)
	ДатаТеста = НачалоМесяца(Дата);                  
	НачСуммаДельта = -1000;
	Шаг = 10;                  
	КонСуммаДельта = 0;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	РегистрБухгалтерии1.Регистратор КАК Регистратор
	                      |ИЗ
	                      |	РегистрБухгалтерии.РегистрБухгалтерии1 КАК РегистрБухгалтерии1
	                      |ГДЕ
	                      |	РегистрБухгалтерии1.Период < &Дата
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	РегистрБухгалтерии1.Период УБЫВ");
	Запрос.УстановитьПараметр("Дата", ДобавитьМесяц(ДатаТеста, 1));
	Выборка = Запрос.Выполнить().Выбрать();                          
	
	Набор = РегистрыБухгалтерии.РегистрБухгалтерии1.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Использование = Истина; //вроде и так Истина  
	
	ПереставитьГраницуВФоне.ПереставитьГраницуВФонеСБлокировкой(КонецМесяца(ДатаТеста));
	
	Парам = Новый Массив;    
	Парам.Добавить(ДобавитьМесяц(КонецМесяца(ДатаТеста), 1));
	ФоновыеЗадания.Выполнить("ПереставитьГраницуВФоне.ПереставитьГраницуВФонеСБлокировкой", Парам);
		
	Если Выборка.Следующий() Тогда
		Набор.Отбор.Регистратор.Значение = Выборка.Регистратор;
		Набор.Прочитать();     
		Набор.ОбменДанными.Загрузка = Истина;
		Набор.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		Сумма1 = Набор[0].Сумма;  
		
		СуммаДельта = НачСуммаДельта;
		
		//ЗаписьЖурналаРегистрации("ОшибкаИтогов.ИзменениеДвижений.Начало", УровеньЖурналаРегистрации.Ошибка,,
		//,"Сумма = Сумма + СуммаДельта (" 
		//+ сокрлп(Сумма1 + НачСуммаДельта) + " = " 
		//+ сокрлп(Сумма1) + " + " 
		//+ сокрлп(СуммаДельта) + ")");  
		
		Пока СуммаДельта < КонСуммаДельта Цикл    
			СуммаДельта = СуммаДельта + Шаг;
			Набор[0].Сумма = Сумма1 + СуммаДельта;
			Набор.Записать();
		КонецЦикла;                
		
		СуммаДельта = КонСуммаДельта;
		Набор[0].Сумма = Сумма1 + СуммаДельта;
		Набор.Записать();
		
		//ЗаписьЖурналаРегистрации("ОшибкаИтогов.ИзменениеДвижений.Окончание", УровеньЖурналаРегистрации.Ошибка,,
		//,"Сумма = Сумма + СуммаДельта (" 
		//+ сокрлп(Сумма1 + СуммаДельта) + " = " 
		//+ сокрлп(Сумма1) + " + " 
		//+ сокрлп(СуммаДельта) + ")");      
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТестИсправленный(Команда)
	ТестИсправленныйНаСервере(Объект.Дата);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестВоспроизведенияОшибкиНаСервере(Дата)
	ДатаТеста = НачалоМесяца(Дата);                  
	НачСуммаДельта = -1000;
	Шаг = 10;                  
	КонСуммаДельта = 0;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	РегистрБухгалтерии1.Регистратор КАК Регистратор
	                      |ИЗ
	                      |	РегистрБухгалтерии.РегистрБухгалтерии1 КАК РегистрБухгалтерии1
	                      |ГДЕ
	                      |	РегистрБухгалтерии1.Период < &Дата
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	РегистрБухгалтерии1.Период УБЫВ");
	Запрос.УстановитьПараметр("Дата", ДобавитьМесяц(ДатаТеста, 1));
	Выборка = Запрос.Выполнить().Выбрать();                          
	
	Набор = РегистрыБухгалтерии.РегистрБухгалтерии1.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Использование = Истина; //вроде и так Истина  
	
	ПереставитьГраницуВФоне.ПереставитьГраницуВФонеСБлокировкой(КонецМесяца(ДатаТеста));
	
	Парам = Новый Массив;    
	Парам.Добавить(ДобавитьМесяц(КонецМесяца(ДатаТеста), 1));
	ФоновыеЗадания.Выполнить("ПереставитьГраницуВФоне.ПереставитьГраницуВФоне", Парам);
	
	Если Выборка.Следующий() Тогда
		Набор.Отбор.Регистратор.Значение = Выборка.Регистратор;
		Набор.Прочитать();     
		Набор.ОбменДанными.Загрузка = Истина;
		Набор.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		Сумма1 = Набор[0].Сумма;  
		
		СуммаДельта = НачСуммаДельта;
		
		//ЗаписьЖурналаРегистрации("ОшибкаИтогов.ИзменениеДвижений.Начало", УровеньЖурналаРегистрации.Ошибка,,
		//,"Сумма = Сумма + СуммаДельта (" 
		//+ сокрлп(Сумма1 + НачСуммаДельта) + " = " 
		//+ сокрлп(Сумма1) + " + " 
		//+ сокрлп(СуммаДельта) + ")");  
		
		Пока СуммаДельта < КонСуммаДельта Цикл    
			СуммаДельта = СуммаДельта + Шаг;
			Набор[0].Сумма = Сумма1 + СуммаДельта;
			Набор.Записать();
		КонецЦикла;                
		
		СуммаДельта = КонСуммаДельта;
		Набор[0].Сумма = Сумма1 + СуммаДельта;
		Набор.Записать();
		
		//ЗаписьЖурналаРегистрации("ОшибкаИтогов.ИзменениеДвижений.Окончание", УровеньЖурналаРегистрации.Ошибка,,
		//,"Сумма = Сумма + СуммаДельта (" 
		//+ сокрлп(Сумма1 + СуммаДельта) + " = " 
		//+ сокрлп(Сумма1) + " + " 
		//+ сокрлп(СуммаДельта) + ")");      
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТестВоспроизведенияОшибки(Команда)
	ТестВоспроизведенияОшибкиНаСервере(Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.Дата = Дата(2022,09,15);
КонецПроцедуры
