
Процедура ПереставитьГраницуВФоне(ДатаИтогов) Экспорт  
	ТекДата = ТекущаяДата();
	Пока ТекДата + 1 < ТекущаяДата() Цикл
	КонецЦикла;
	РегистрыНакопления.РегистрНакопления1.УстановитьМаксимальныйПериодРассчитанныхИтогов(ДатаИтогов);
КонецПроцедуры

Процедура ПереставитьГраницуВФонеСБлокировкой(ДатаИтогов) Экспорт  
	ТекДата = ТекущаяДата();
	Пока ТекДата + 1 < ТекущаяДата() Цикл
	КонецЦикла;
	НачатьТранзакцию();
	
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РегистрНакопления1.НаборЗаписей");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();        
	
		РегистрыНакопления.РегистрНакопления1.УстановитьМаксимальныйПериодРассчитанныхИтогов(ДатаИтогов);
		
	ЗафиксироватьТранзакцию();
КонецПроцедуры